---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCParallelFlange
source: html/071e3d7e-3c44-13d3-5b21-86366f8c4d2f.htm
---
# StructuralSectionCParallelFlange Members

Creates a new instance of Structural Section C Parallel Flange shape with the associated set of parameters,
 used to attach to structural element.